<?php
    
	/**
	 * 所有订单状态
	 *
	 * @var array
	 */
	return  array(
		'0'  => array(
			'ADMIN_' => '客户提交了在线支付订单，等待付款', //后台管理员看到的状态
			'USER_S' => '待付款',         //用户看到的订单状态
			'ACTION' => '下[在线支付类型]订单',             //执行的操作
			'SHORT'  => '待付款'            //列表中显示的简短订单状态
		),

		'1'  => array(
			'ADMIN_' => '订单已经支付成功，等待审核',
			'USER_S' => '待审核',
			'ACTION' => '支付订单',
			'SHORT'  => '待审核'
		),

		'200'  => array(
			'ADMIN_' => '客户提交了货到付款订单,等待审核',
			'USER_S' => '货到付款审核',
			'ACTION' => '下[货到付款类型]订单',
			'SHORT'  => '待审核'
		),

		'201'  => array(
			'ADMIN_' => '指派服务商',
			'USER_S' => '待接单',
			'ACTION' => '指派服务',
			'SHORT'  => '待接单'
		),

		'202'  => array(
			'ADMIN_' => '商家指派完成,等待商家确认',
			'USER_S' => '待接单',
			'ACTION' => '等待商家确认',
			'SHORT'  => '待接单'
		),

		'300'  => array(
			'ADMIN_' => '商家完成确认',
			'USER_S' => '待服务',
			'ACTION' => '客服审核通过',
			'SHORT'  => '待服务'
		),
		
		'301'  => array(
			'ADMIN_' => '客户确认服务',
			'USER_S' => '进行中',
			'ACTION' => '正在服务',
			'SHORT'  => '进行中'
		),
	    
	    '302'  => array(     //新版新增状态
	        'ADMIN_' => '美业师拒单',
	        'USER_S' => '已拒单',
	        'ACTION' => '已拒单',
	        'SHORT'  => '已拒单'
	    ),
	    
	    '303'  => array(   //新版新增状态
	        'ADMIN_' => '用户待评价',
	        'USER_S' => '待评价',
	        'ACTION' => '待评价',
	        'SHORT'  => '待评价'
	    ),

		'1000'  => array(
			'ADMIN_' => '订单完成，等待结算',
			'USER_S' => '完成订单',
			'ACTION' => '服务完毕',
			'SHORT'  => '服务完毕'
		),

		'1200'  => array(
			'ADMIN_' => '完成结算',
			'USER_S' => '已完成',
			'ACTION' => '服务完毕',
			'SHORT'  => '已完成'
		),

		'10000'  => array(
			'ADMIN_' => '订单已被取消，退款结算',
			'USER_S' => '订单已取消，待退款',
			'ACTION' => '取消订单',
			'SHORT'  => '已取消'
		),

		'11000'  => array(
			'ADMIN_' => '订单已被取消，交易结束',
			'USER_S' => '已取消',
			'ACTION' => '取消订单',
			'SHORT'  => '已取消'
		),

		
	);



